# GetGraphicOverrides Method (String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingDisplaySettings..::..GetGraphicOverrides Method (String)
WorksharingDisplaySettings Class See Also
---
Returns the graphic overrides assigned for elements owned by a particular user.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public WorksharingDisplayGraphicSettings GetGraphicOverrides(
	string username
)
```

Visual Basic
---
```text
Public Function GetGraphicOverrides ( _
	username As String _
) As WorksharingDisplayGraphicSettings
```

Visual C++
---
```text
public:
WorksharingDisplayGraphicSettings^ GetGraphicOverrides(
	String^ username
)
```

# ### Parameters
username
    Type: System..::..String The username of a particular user.
# ### Return Value
The graphic overrides assigned to this user.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | This WorksharingDisplaySettings does not contain graphic overrides for the specified value of username. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
WorksharingDisplaySettings Class
GetGraphicOverrides Overload
Autodesk.Revit.DB Namespace